EmailEvents
| where DetectionMethods != "" 
| extend detection = tostring(parse_json(DetectionMethods).Phish) 
| where detection has "File detonation reputation" or detection has "File detonation"
| summarize total = count() by bin(Timestamp, 1d), NetworkMessageId, ReportId, RecipientEmailAddress
| order by Timestamp asc
| project Timestamp, total, NetworkMessageId, ReportId, RecipientEmailAddress
